# Pandas - Part 3

## 6. Operations

In [10]:
import numpy as np
import pandas as pd

In [11]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})

In [12]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [14]:
# find unique values, returns a numpy array
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [15]:
# find the totoal number of unique values
df['col2'].nunique()

3

In [16]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [20]:
df[(df['col2']>400) & (df['col1']>2)]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

### * .apply()

In [21]:
def times2(x):
    return x*2

In [22]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [26]:
# .apply is extramely useful when combined with lambda expression
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

### * drop()

In [30]:
df.drop('col1',axis=1) # not inplace

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

### * .columns / .index properties

In [32]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [37]:
df.index

RangeIndex(start=0, stop=4, step=1)

### * .sort_values()

In [36]:
# sorting
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

### * .isnull()

In [35]:
# find null values
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### * pivot table

In [41]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,2,3,4,5,1]}

df = pd.DataFrame(data)

In [43]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  5.0  1.0
    two  NaN  4.0
foo one  1.0  2.0
    two  3.0  NaN